configs/latex-preambles.org
#+TITLE: Preámbulos de LaTeX
#+SUBTITLE: Una configuración que usa las clases article,book y LuaLaTeX
#+AUTHOR: Jhonny Lanzuisi
#+TAGS: :latex:preamble:
#+PROPERTY: header-args :eval never :exports code :noweb tangle
#+SETUPFILE: /home/jhonny/git/org-mode/style.css.org
#+LATEX_HEADER: \asignatura{Tipografía en TeX}
# LICENSE: See license notice bellow

#+BEGIN_SRC latex :exports none
%----README----
% This TeX file was automatically generated by GNU Emacs's Org Mode.
% For better documentation refer to the corresponding Org file, 
% which you can find in the sources specified bellow.
% Do keep in mind that this file undergoes little to none manual revision.
%----LICENSE---
% Copyright 2021 Jhonny Lanzuisi (jalb97@gmail.com)
% More source files at github.com/JLanzuisi
%
% This program is free software: you can redistribute it and/or modify
% it under the terms of the GNU General Public License as published by
% the Free Software Foundation, either version 3 of the License, or
% (at your option) any later version.
%
% This program is distributed in the hope that it will be useful,
% but WITHOUT ANY WARRANTY; without even the implied warranty of
% MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
% GNU General Public License for more details.
%
% You should have received a copy of the GNU General Public License
% along with this program.  If not, see <https://www.gnu.org/licenses/>.
%--------------
#+END_SRC

Este archivo explica mi configuración de LaTeX.
La idea es usar el estilo de la "programación letrada",
por lo que la prosa y los bloques de código se mezclan.

‖
Las herramientas utilizadas para lograr esta mezcla de código y texto
son Emacs y Org.
Las porciones del texto, como esta, que estan encerradas en doble barra vertical
hablan sobre cosas que tienen que ver con este sistema de emacs+org
y no de la configuración de LaTeX.

Además de las herramientas mencionadas antes,
parte de la sintanxis y el estilo pronvienen del sistema =WEB=
inventado por Don Knuth.
‖

En LaTeX solo me han hecho falta dos tipos de documentos,
los que usan como base la clase =article= y los que usan la clase =book=.
Como ambos comparten partes del código,
es pues sensato que ambos preámbulos sean descritos en este archivo.

Todos los preambulos que se generan de este archivo
pueden encontrarse de forma íntegra al final del documento,
en caso de que se quiera hacer referencia al código directamente.

* Configuraciones varias de TeX
Esta parte hace que TeX no reporte overfull (o underfull) boxes si son muy pequeñas.
Además, hace la marca de una overfull más grande, para que sea más fácil de ver

#+NAME:misc-tex-config
#+BEGIN_SRC latex
\hfuzz1pc
\overfullrule=2cm
#+END_SRC

* Configuración de idioma
Aquí de configura el español, junto con una opción para que los párrafos que siguen a un título no estén identados.

#+NAME:language-babel
#+BEGIN_SRC latex
\usepackage[spanish,es-noindentfirst]{babel}
\usepackage{csquotes}
#+END_SRC

* Dimensiones de la página
Los márgenes se configuran aquí. Junto con el tamaño del papel, actualmente en carta.

#+NAME:page-size-article
#+BEGIN_SRC latex
\usepackage
[
	includehead,
	includefoot,
	top=.5cm,
	bottom=.5cm,
	left=1.7cm,
	right=7.3cm,
	marginparsep=0.5cm,
	marginparwidth=7cm,
]
{geometry}
#+END_SRC

* Tipografías (texto y matemáticas)

** Tipografías compartidas
  :PROPERTIES:
  :header-args: :noweb-ref fonts-common :eval never :exports code
  :END:

Esta sección describe las fuentes que ambas clases comparten.

Primero cargamos los paquetes de la AMS para tener algunos símbolos y entornos útiles.
También se definen algunos operadores.

#+BEGIN_SRC latex
\usepackage{mathtools}
\DeclareMathOperator{\Rea}{Re}
\DeclareMathOperator{\Ima}{Im}
\DeclareMathOperator{\car}{car}
\DeclareMathOperator{\traz}{tr}
\DeclareMathOperator{\gen}{gen}
\DeclareMathOperator{\mcm}{mcm}
#+END_SRC

Las fuentes utilizan el paquete =fontspec=, por lo que =lualatex= o =xelatex= son necesarios.
Además, dado que =unicode-math= carga =fontspec= por defecto, es suficiente con:

#+BEGIN_SRC latex
\usepackage{unicode-math}
#+END_SRC

Ahora, si, las fuentes del texto.
Se usan por defecto números proporcionales y "oldstyle".

#+BEGIN_SRC latex
\setmainfont{STEP}
\defaultfontfeatures{Scale=MatchLowercase}
\setsansfont{Source Sans Pro}
\setmonofont{Hack}
#+END_SRC

Algo de espacio entre las lineas. El comando =\frenchspacing= hace que LaTeX coloque un solo espacio después de los puntos.

#+BEGIN_SRC latex
\frenchspacing
\linespread{1.05}
#+END_SRC

Las fuentes de matemáticas estan basadas en Times Roman.

#+BEGIN_SRC latex
\setmathfont{STEP Math}
#+END_SRC

Y por último, ajustes microtipográficos.

#+BEGIN_SRC latex
\usepackage[final]{microtype}
#+END_SRC

** Especifico de los artículos

La fuente de los títulos viene dada por el siguiente bloque.

#+NAME:fonts-article-headfont
#+BEGIN_SRC latex
\newcommand{\headfont}{\sffamily}
#+END_SRC

* Paquetes varios

** Paquetes compartidos
  :PROPERTIES:
  :header-args: :noweb-ref packages-common  :eval never :exports code
  :END:

Primero, un línea que permite cargar las imágenes del documente según hagan falta.
Esto se hace pasando la opción "borrador" al paquete que se encarga de las imágenes.
Luego, una opción para poder usar los nombres de los colores en =xcolor=.

#+BEGIN_SRC latex
\PassOptionsToPackage{final}{graphicx}
\PassOptionsToPackage{dvipsnames}{xcolor}
#+END_SRC

Ahora, diversos paquetes útiles o que sirven de dependencias a otros.
La mayoría son fáciles de entender, en cualquier caso chequeen la documentación individual de cada paquete (en GNU/Linux, con TeXLive, =texdoc $package-name=).

#+BEGIN_SRC latex
\usepackage
{
	xcolor,
	graphicx,
	cancel,
	booktabs,
	hyphenat,
	authoraftertitle,
	pdfpages,
	metalogo
}
#+END_SRC

* Referencias y bibliografía
  :PROPERTIES:
  :header-args: :noweb-ref bib-common  :eval never :exports code
  :END:

El siguiente bloque configura el estylo de la bibliografía,
y además especifica el comando =biber= para procesar los archivos,
evidentemente hará falat tener =biber= instalado para usarlo.
La línea que especifica el lugar del archi =.bib= debe ser editada, evidentemente, si no se tiene una estructura de archivos idéntica.

#+BEGIN_SRC latex
\usepackage
[
backend=biber,
backref=true,
citestyle=authortitle,
bibstyle=authortitle,
sorting=ynt
]
{biblatex}
\addbibresource{/home/jhonny/git/Misc-LaTeX-files/bib/general.bib}
#+END_SRC
Nótese la opción =backref=true=, que permite hacer referencias desde la página de la bibliografía al texto.

Ahora, se configura la apriencia de las referencias y los url.
El paquete =cleveref= es bastante ùtil.

#+BEGIN_SRC latex
\usepackage{url} 
\usepackage{hyperref} 
\definecolor{Carmine}{HTML}{960018}
\newcommand{\linkcolor}{Carmine}
\hypersetup
{
colorlinks=true,
linkcolor=\linkcolor,
urlcolor=\linkcolor,
citecolor=\linkcolor
}
\usepackage[spanish,nameinlink]{cleveref} 
#+END_SRC

* Notas al márgen
  :PROPERTIES:
  :header-args: :noweb-ref margin-notes-article  :eval never :exports code
  :END:

Esta parte define los comandos para añadir notas al margen.
Primero, un nuevo comando que sirve como "variable" para elegir la fuente a usar en el margen =marfont=.

#+BEGIN_src latex
\newcommand{\marfont}{} 
#+END_src

Ahora, cambiamos el comando =marginpar= para que use esa fuente,
y este alineado a la izquierda.

#+BEGIN_SRC latex
%\renewcommand*{\marginfont}{\marfont}
\let\oldmarginpar\marginpar
\renewcommand
	{\marginpar}
	[1]
	{
	\oldmarginpar{\raggedright\marfont #1}
	}
#+END_SRC

El siguiente es un comando que inserta notas al margen numeradas.

#+BEGIN_SRC latex
\newcounter{nota}
\newcommand
	{\nota}
	[1]
	{
	\refstepcounter{nota}\textsuperscript{\thenota}
	\marginpar{
		\raggedright\itshape\thenota. #1
		}
	}
#+END_SRC

Por último, que el comando =footnote= sea lo mismo que =nota=, para que el documento TeX sea mas portable.

#+BEGIN_SRC latex
\renewcommand{\footnote}{\nota}
#+END_SRC

