configs/latex-preambles.txt
	   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
			  PREÁMBULOS DE LATEX
		  Una configuración que usa las clases
			article,book y LuaLaTeX

			    Jhonny Lanzuisi
	   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


Table of Contents
─────────────────

1. Configuraciones varias de TeX
2. Configuración de idioma
3. Dimensiones de la página
4. Tipografías (texto y matemáticas)
.. 1. Tipografías compartidas
.. 2. Especifico de los artículos
5. Paquetes varios
.. 1. Paquetes compartidos
6. Referencias y bibliografía
7. Notas al márgen
8. Listas
9. Página de título en los artículos
10. Bloques de código
11. Leyendas para figuras y tablas
12. Títulos de secciones y la lista de contenidos
.. 1. Artículos
.. 2. Libros
13. Encabezados y pies de página
.. 1. Artículos
14. Entornos de teoremas
15. Los preambulos completos
.. 1. Articulos
.. 2. Libros


Este archivo explica mi configuración de LaTeX.  La idea es usar el
estilo de la "programación letrada", por lo que la prosa y los bloques
de código se mezclan.

‖ Las herramientas utilizadas para lograr esta mezcla de código y texto
son Emacs y Org.  Las porciones del texto, como esta, que estan
encerradas en doble barra vertical hablan sobre cosas que tienen que ver
con este sistema de emacs+org y no de la configuración de LaTeX.

Además de las herramientas mencionadas antes, parte de la sintanxis y el
estilo pronvienen del sistema `WEB' inventado por Don Knuth.  ‖

En LaTeX solo me han hecho falta dos tipos de documentos, los que usan
como base la clase `article' y los que usan la clase `book'.  Como ambos
comparten partes del código, es pues sensato que ambos preámbulos sean
descritos en este archivo.

Todos los preambulos que se generan de este archivo pueden encontrarse
de forma íntegra al final del documento, en caso de que se quiera hacer
referencia al código directamente.


1 Configuraciones varias de TeX
═══════════════════════════════

  Esta parte hace que TeX no reporte overfull (o underfull) boxes si son
  muy pequeñas.  Además, hace la marca de una overfull más grande, para
  que sea más fácil de ver

  ┌────
  │ \hfuzz1pc
  │ \overfullrule=2cm
  └────


2 Configuración de idioma
═════════════════════════

  Aquí de configura el español, junto con una opción para que los
  párrafos que siguen a un título no estén identados.

  ┌────
  │ \usepackage[spanish,es-noindentfirst]{babel}
  │ \usepackage{csquotes}
  └────


3 Dimensiones de la página
══════════════════════════

  Los márgenes se configuran aquí. Junto con el tamaño del papel,
  actualmente en carta.

  ┌────
  │ \usepackage
  │ [
  │ 	includehead,
  │ 	includefoot,
  │ 	top=.5cm,
  │ 	bottom=.5cm,
  │ 	left=1.7cm,
  │ 	right=7.3cm,
  │ 	marginparsep=0.5cm,
  │ 	marginparwidth=7cm,
  │ ]
  │ {geometry}
  └────


4 Tipografías (texto y matemáticas)
═══════════════════════════════════

4.1 Tipografías compartidas
───────────────────────────

  Esta sección describe las fuentes que ambas clases comparten.

  Primero cargamos los paquetes de la AMS para tener algunos símbolos y
  entornos útiles.  También se definen algunos operadores.

  ┌────
  │ \usepackage{mathtools}
  │ \DeclareMathOperator{\Rea}{Re}
  │ \DeclareMathOperator{\Ima}{Im}
  │ \DeclareMathOperator{\car}{car}
  │ \DeclareMathOperator{\traz}{tr}
  │ \DeclareMathOperator{\gen}{gen}
  │ \DeclareMathOperator{\mcm}{mcm}
  └────

  Las fuentes utilizan el paquete `fontspec', por lo que `lualatex' o
  `xelatex' son necesarios.  Además, dado que `unicode-math' carga
  `fontspec' por defecto, es suficiente con:

  ┌────
  │ \usepackage{unicode-math}
  └────

  Ahora, si, las fuentes del texto.  Se usan por defecto números
  proporcionales y "oldstyle".

  ┌────
  │ \setmainfont{STEP}
  │ \defaultfontfeatures{Scale=MatchLowercase}
  │ \setsansfont{Source Sans Pro}
  │ \setmonofont{Hack}
  └────

  Algo de espacio entre las lineas. El comando `\frenchspacing' hace que
  LaTeX coloque un solo espacio después de los puntos.

  ┌────
  │ \frenchspacing
  │ \linespread{1.05}
  └────

  Las fuentes de matemáticas estan basadas en Times Roman.

  ┌────
  │ \setmathfont{STEP Math}
  └────

  Y por último, ajustes microtipográficos.

  ┌────
  │ \usepackage[final]{microtype}
  └────


4.2 Especifico de los artículos
───────────────────────────────

  La fuente de los títulos viene dada por el siguiente bloque.

  ┌────
  │ \newcommand{\headfont}{\sffamily}
  └────


5 Paquetes varios
═════════════════

5.1 Paquetes compartidos
────────────────────────

  Primero, un línea que permite cargar las imágenes del documente según
  hagan falta.  Esto se hace pasando la opción "borrador" al paquete que
  se encarga de las imágenes.  Luego, una opción para poder usar los
  nombres de los colores en `xcolor'.

  ┌────
  │ \PassOptionsToPackage{final}{graphicx}
  │ \PassOptionsToPackage{dvipsnames}{xcolor}
  └────

  Ahora, diversos paquetes útiles o que sirven de dependencias a otros.
  La mayoría son fáciles de entender, en cualquier caso chequeen la
  documentación individual de cada paquete (en GNU/Linux, con TeXLive,
  `texdoc $package-name').

  ┌────
  │ \usepackage
  │ {
  │ 	xcolor,
  │ 	graphicx,
  │ 	cancel,
  │ 	booktabs,
  │ 	hyphenat,
  │ 	authoraftertitle,
  │ 	pdfpages,
  │ 	metalogo
  │ }
  └────


6 Referencias y bibliografía
════════════════════════════

  El siguiente bloque configura el estylo de la bibliografía, y además
  especifica el comando `biber' para procesar los archivos,
  evidentemente hará falat tener `biber' instalado para usarlo.  La
  línea que especifica el lugar del archi `.bib' debe ser editada,
  evidentemente, si no se tiene una estructura de archivos idéntica.

  ┌────
  │ \usepackage
  │ [
  │ backend=biber,
  │ backref=true,
  │ citestyle=authortitle,
  │ bibstyle=authortitle,
  │ sorting=ynt
  │ ]
  │ {biblatex}
  │ \addbibresource{/home/jhonny/git/Misc-LaTeX-files/bib/general.bib}
  └────
  Nótese la opción `backref=true', que permite hacer referencias desde
  la página de la bibliografía al texto.

  Ahora, se configura la apriencia de las referencias y los url.  El
  paquete `cleveref' es bastante ùtil.

  ┌────
  │ \usepackage{url} 
  │ \usepackage{hyperref} 
  │ \definecolor{Carmine}{HTML}{960018}
  │ \newcommand{\linkcolor}{Carmine}
  │ \hypersetup
  │ {
  │ colorlinks=true,
  │ linkcolor=\linkcolor,
  │ urlcolor=\linkcolor,
  │ citecolor=\linkcolor
  │ }
  │ \usepackage[spanish,nameinlink]{cleveref} 
  └────


7 Notas al márgen
═════════════════

  Esta parte define los comandos para añadir notas al margen.  Primero,
  un nuevo comando que sirve como "variable" para elegir la fuente a
  usar en el margen `marfont'.

  ┌────
  │ \newcommand{\marfont}{} 
  └────

  Ahora, cambiamos el comando `marginpar' para que use esa fuente, y
  este alineado a la izquierda.

  ┌────
  │ %\renewcommand*{\marginfont}{\marfont}
  │ \let\oldmarginpar\marginpar
  │ \renewcommand
  │ 	{\marginpar}
  │ 	[1]
  │ 	{
  │ 	\oldmarginpar{\raggedright\marfont #1}
  │ 	}
  └────

  El siguiente es un comando que inserta notas al margen numeradas.

  ┌────
  │ \newcounter{nota}
  │ \newcommand
  │ 	{\nota}
  │ 	[1]
  │ 	{
  │ 	\refstepcounter{nota}\textsuperscript{\thenota}
  │ 	\marginpar{
  │ 		\raggedright\itshape\thenota. #1
  │ 		}
  │ 	}
  └────

  Por último, que el comando `footnote' sea lo mismo que `nota', para
  que el documento TeX sea mas portable.

  ┌────
  │ \renewcommand{\footnote}{\nota}
  └────


8 Listas
════════
