configs/latex-preambles.org
* Encabezados y pies de página
Es normalmente recomendado usar para esto una clase de =koma-script=,
y probablemente sea lo que haga en un futuro, por ahora funciona.

El paquete que se encarga de todo.
#+BEGIN_SRC latex :noweb-ref fancyhdr-common  :eval never :exports code
\usepackage{fancyhdr}
#+END_SRC

Ahora, que no haya una linea horizontal en los encabezados, 
y además ahcerlos suficientemente grandes.

#+BEGIN_SRC latex :noweb-ref fancyhdr-common-2  :eval never :exports code
\renewcommand{\headrulewidth}{0pt}
\setlength{\headheight}{14pt}
#+END_SRC

** Artículos
  :PROPERTIES:
  :header-args: :noweb-ref fancyhdr-article  :eval never :exports code
  :END:

Ahora si, la configuración.
La construcción =if... else...= permite colocar cosas diferentes en las páginas pares e impares.
#+BEGIN_SRC latex
\pagestyle{fancy}
\fancyhf{}
\fancyhead
	[L]
	{
	\ifodd\value{page}\MyTitle\else\Asignatura\fi
	}
\fancyhead[R]{\thepage}
\fancypagestyle
	{plain}
	{
	\fancyhead[R]{}
	\fancyhead[L]{}
	\fancyfoot[R]{}%
	\fancyfoot[L]{}
	\fancyfoot[C]{}
	}
#+END_SRC

* Entornos de teoremas
  :PROPERTIES:
  :header-args: :noweb-ref theorems-common  :eval never :exports code
  :END:

Declaración y configuración de los entornos de teoremas.
Para esto, usamos el siguiente paquete.

#+BEGIN_SRC latex
\usepackage[thmmarks]{ntheorem}
#+END_SRC

Ahora, los entornos numerados.

#+BEGIN_SRC latex
\theoremstyle{plain}
\theorempreskip{\medskipamount}
\theorempostskip{\medskipamount}
\theorembodyfont{\upshape}
\theoremseparator{.}
{
\theoremheaderfont{\itshape}
\newtheorem{definition}{Definición}
}
{
\theoremheaderfont{\scshape}
\newtheorem{theorem}{Teorema}
}
#+END_SRC

* Los preambulos completos

Esta sección reproduce los archivos
cuyas partes han sido descritas y explicadas anteriormente.

‖
En el archivo =.org= esto es bastanet sencillo de lograr.
Simplemente hace falta crear un bloque =src= que contiene lo siguiente:

#+BEGIN_SRC
<<first-keyword>>

<<second-keyword>>
#+END_SRC

Donde los =*-keyword= son los nombres de los bloques de código que se han de insertar.
Esto junto con la opción =:noweb yes=
permite crear el archivo =.tex= en el disco que se usará para compilar LaTeX
y al mismo tiempo coloca una copia de dicho archivo en el documento exportado.
‖

** Articulos

#+NAME:article-preamble
#+BEGIN_SRC latex :noweb yes :tangle ~/git/LaTeX-University/preamble-article-test.tex 
<<misc-tex-config>>

<<language-babel>>

<<page-size-article>>

<<fonts-common>>
<<fonts-article-headfont>>

<<packages-common>>

<<bib-common>>

<<margin-notes-article>>

<<lists-common>>

<<article-maketitle>>

<<code-listings-common>>
<<captions-common>>

<<titlesec-common>>
<<titlesec-article>>

<<fancyhdr-common>>
<<fancyhdr-common-2>>
<<fancyhdr-article>>

<<theorems-common>>
#+END_SRC

** Libros
