configs/latex-preambles.txt
  │ \usepackage{fancyhdr}
  │ \renewcommand{\headrulewidth}{0pt}
  │ \setlength{\headheight}{14pt}
  │ \pagestyle{fancy}
  │ \fancyhf{}
  │ \fancyhead
  │ 	[L]
  │ 	{
  │ 	\ifodd\value{page}\MyTitle\else\Asignatura\fi
  │ 	}
  │ \fancyhead[R]{\thepage}
  │ \fancypagestyle
  │ 	{plain}
  │ 	{
  │ 	\fancyhead[R]{}
  │ 	\fancyhead[L]{}
  │ 	\fancyfoot[R]{}%
  │ 	\fancyfoot[L]{}
  │ 	\fancyfoot[C]{}
  │ 	}
  │ 
  │ \usepackage[thmmarks]{ntheorem}
  │ \theoremstyle{plain}
  │ \theorempreskip{\medskipamount}
  │ \theorempostskip{\medskipamount}
  │ \theorembodyfont{\upshape}
  │ \theoremseparator{.}
  │ {
  │ \theoremheaderfont{\itshape}
  │ \newtheorem{definition}{Definición}
  │ }
  │ {
  │ \theoremheaderfont{\scshape}
  │ \newtheorem{theorem}{Teorema}
  │ }
  └────


15.2 Libros
───────────
